/*******************************************************************************
 深圳市汇川技术有限公司 版权所有（C）All rights reserved.                    
 文件名:    PUB_Table.h  
 创建人：   梅仕峰                 创建日期：2008.06.31                     
 修改人：   李浩                   修改日期：2012.03.26
 描述： 
    1.
    2.
 修改记录：  
    XXXX.XX.XX  XXXXXXX
    1.
    2.
********************************************************************************/ 
#ifndef __PUB_TABLE_H
#define __PUB_TABLE_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
/* 引用头文件 */
#include "PUB_GlobalPrototypes.h"

/* Exported_Constants --------------------------------------------------------*/
/* 不带参数的宏定义 */


/* Exported_Macros -----------------------------------------------------------*/
/* 带参数的宏定义 */


/* Inline Function --------------------------------------------------------*/
/* 内联函数定义 */


/* Exported_Variables --------------------------------------------------------*/
/* 可供其它文件调用变量的声明 */   
extern const int16  SinTable[]; 
extern int16 SinCal(Uint32 SinIndex_Q12);  //正弦查表计算结果
extern int16 CosCal(Uint32 CosIndex_Q12);	//余弦查表计算结果
 
/* Exported_Functions --------------------------------------------------------*/
/* 可供其它文件调用的函数的声明 */ 
extern void Pub_AbsRomInit(void);

#ifdef __cplusplus
}
#endif

#endif /* __PUB_TABLE_H */

/********************************* END OF FILE *********************************/
